---
kind: type
id: T:Autodesk.Revit.DB.Face
source: html/e32b3b1f-66fc-57cb-6e1c-aa81d1bf3e63.htm
---
# Autodesk.Revit.DB.Face

A bounded face of a 3d solid or open shell.

## Syntax (C#)
```csharp
public class Face : GeometryObject
```

## Remarks
Faces are defined by surfaces ( Surface ) bounded by edge loops. The surfaces provide
natural UV parameterization to the faces.